Долома/src/Catalogs/БыкиПлеменные/БыкиПлеменные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БыкиПлеменные</name>
  <predefined>
    <items>
      <name>НеопределенныйОтец</name>
      <description>Неопределенный отец</description>
    </items>
  </predefined>
  <attributes>
    <name>КодСемени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кличка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаботает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивное</name>
    <comment>Элемент находится в архиве. Учет по животному НЕ ведется.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КличкаНаЛатинице</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БетаКазеин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаппаКазеин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнаяКличка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Родословная</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </attributes>
</mdclass:Catalog>

Долома/src/InformationRegisters/РодственныеСвязи/РодственныеСвязи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РодственныеСвязи</name>
  <resources>
    <name>Ряд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РядРимскими</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предок</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСвязи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Препарат</name>
  </enumValues>
  <enumValues>
    <name>Семя</name>
  </enumValues>
  <enumValues>
    <name>Корм</name>
  </enumValues>
  <enumValues>
    <name>ЗооТовары</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

Долома/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <predefined>
    <items>
      <name>Животное</name>
      <description>Животное</description>
    </items>
    <items>
      <name>Молоко</name>
      <description>Молоко</description>
    </items>
  </predefined>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Бык</name>
    <type>
      <types>CatalogRef.БыкиПлеменные</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСемени</name>
    <type>
      <types>EnumRef.ТипыСемени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКорма</name>
    <type>
      <types>EnumRef.ВидыКормов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаКорма</name>
    <type>
      <types>CatalogRef.ГруппыКормов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЕдиницыИзмерения</name>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Долома/src/Catalogs/БыкиПлеменные/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СформироватьДеревоСвязей();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Предопределенный
					И Объект.НеРаботает Тогда
					
					ОписаниеОповещения = Новый ОписаниеОповещения("ПустоеОповещение", ОбщегоНазначения);
					ПоказатьПредупреждение(ОписаниеОповещения, "Неопределенного быка нельзя сделать архивным");
					
					Отказ = Истина;
					
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Параметры.Ключ.Пустая() Тогда 
		ЗаполнитьДанныеОСемени();
		
		ЗаполнитьДанныеОбИндексах();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСемениПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ФормаСправочника = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента");
	ДанныеФормы 	 = ФормаСправочника.Объект;
	
	СозданиеНовогоТипаСемени(ДанныеФормы);
	
	КопироватьДанныеФормы(ДанныеФормы, ФормаСправочника.Объект);
	
	ФормаСправочника.Открыть();
	
КонецПроцедуры

&НаСервере
Функция СозданиеНовогоТипаСемени(ДанныеФормы)
	
	СправочникОбъект = ДанныеФормыВЗначение(ДанныеФормы, Тип("СправочникОбъект.Номенклатура"));
	СправочникОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	СправочникОбъект.Бык = Объект.Ссылка;
	//СправочникОбъект.Семя = Истина;  
	СправочникОбъект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Семя");
	ЗначениеВДанныеФормы(СправочникОбъект, ДанныеФормы);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокПартийСемениВБыках" Тогда
			
		ЗаполнитьДанныеОСемени();		
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КличкаПриИзменении(Элемент)
	
	НаименованиеБыкаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеБыка(Элемент)
	
	НаименованиеБыкаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НаименованиеБыкаНаСервере()
	
	Объект.Наименование = Объект.Кличка + " " + Объект.КодСемени;
	
КонецПроцедуры

&НаКлиенте
Процедура КодСемениПриИзменении(Элемент)
	
	НаименованиеБыкаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРодственныхСвязейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ДеревоРодственныхСвязей.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Предок) Тогда
		ПоказатьЗначение(,ТекущиеДанные.Предок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодословнаяПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Родословная) Тогда
		СформироватьДеревоСвязей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияИндексов(Команда)
	
	ФормаИндексов = ПолучитьФорму("РегистрСведений.ИндексыБыков.Форма.ФормаСписка");
	
	 ЭлементОтбора = ФормаИндексов.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Бык");
	 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	 ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; // Опционально
     ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	 
	 ФормаИндексов.Открыть();
	 
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеОСемени()
	
	СписокСемени.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Семя
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Бык = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	СписокСемени.Загрузить(РезультатЗапроса.Скопировать());
	
КонецФункции

&НаСервере
Функция ЗаполнитьДанныеОбИндексах()
	
	ИндексыБыков = ДанныеЖивотных.ПолучитьИндексыБыка(Объект.Ссылка);
	
	TPI 	= ИндексыБыков.TPI;
	NM 		= ИндексыБыков.NM;
	Молоко 	= ИндексыБыков.Молоко;
	CCR 	= ИндексыБыков.CCR;
	PL 		= ИндексыБыков.PL;
	HCR 	= ИндексыБыков.HCR;
	
КонецФункции

&НаСервере
Процедура СформироватьДеревоСвязей()

	ДеревоСвязей = РегистрыСведений.РодственныеСвязи.СформироватьДеревоСвязей(Объект.Родословная);
	ЗначениеВДанныеФормы(ДеревоСвязей, ДеревоРодственныхСвязей);

КонецПроцедуры
